Revit 2027 API
StructuralConnectionType.SetFamilySymbolId Method
 FamilySymbol of the annotation to use for this connection type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetFamilySymbolId(
	ElementId familySymbolId
)
Public Sub SetFamilySymbolId (
	familySymbolId As ElementId
)
public:
void SetFamilySymbolId(
	ElementId^ familySymbolId
)
member SetFamilySymbolId :
        familySymbolId : ElementId -> unit
Parameters
familySymbolId ElementId
Exceptions
Exception | Condition
ArgumentException |  Thrown when familySymbolId is the id of some element that is not a FamilySymbol, is not of the category "Connection Symbols" (OST_StructConnectionSymbols), or has its "Apply To" parameter not equal to this type's applyTo property.
ArgumentNullException |  A non-optional argument was null
Remarks
 The FamilySymbol must be of category "Connection Symbols" (OST_StructConnectionSymbols) and have its "Apply To" parameter set to match the applyTo property.
See Also
Reference
StructuralConnectionType Class
Autodesk.Revit.DB.Structure Namespace